# ExportFontKey Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportFontKey Constructor
ExportFontKey Class See Also
---
Constructs a new default ExportFontKey.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ExportFontKey()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ExportFontKey()
```

# See Also
ExportFontKey Class
ExportFontKey Overload
Autodesk.Revit.DB Namespace